cask_args appdir: '/Applications'


tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "awscli"
brew "glib"
brew "gnutls"
brew "harfbuzz"
brew "gobject-introspection"
brew "ffmpeg"
brew "git"
brew "go"
brew "n"
brew "nodebrew"
brew "sl"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "yarn"
brew "python3"

cask "aws-vault"
cask "docker"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "postman"
cask "google-chrome"
cask "firefox"
cask "zoom"
cask "displaylink"
cask "logitech-options"

mas "Microsoft Excel", id: 462054704
mas "Microsoft Word", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Discord", id: 985746746
mas "Slack", id: 803453959
mas "Enpass", id: 1444383602
mas "Google Sheets", id: 842849113
mas "Google Docs", id: 842849113
mas "Google Slides", id: 842849113
mas "Google Drive", id: 507874739
